app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY created_at desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
	def index
		@posts = Post.all.order("created_at desc").paginate(page: params[:page], per_page: 2)

INSERT INTO "posts" ("title", "content", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
		@post = Post.new post_params

		if @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test post Updated"], ["updated_at", "2016-05-01 05:16:06.193715"], ["id", 1]]
---
	def update
		if @post.update post_params

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
	def find_post
		@post = Post.friendly.find(params[:id])