app/controllers/welcome_controller.rb

	def index
		@posts = Post.all.limit(3).order("created_at desc")
		@projects = Project.all.limit(3).order("created_at desc")
---
SELECT  "posts".* FROM "posts"  ORDER BY created_at desc LIMIT 3
SELECT  "projects".* FROM "projects"  ORDER BY created_at desc LIMIT 3